submissions/single-gpu-backfill-random-online-9ca08a102-20260814/bench.stdout.log
INFO 08-14 02:58:59 [__init__.py:44] Available plugins for group vllm.platform_plugins:
INFO 08-14 02:58:59 [__init__.py:46] - ascend -> vllm_ascend:register
INFO 08-14 02:58:59 [__init__.py:58] Loading plugin ascend
INFO 08-14 02:58:59 [__init__.py:246] Platform plugin ascend is activated
INFO 08-14 02:58:59 [platform.py:60] Breakable cudagraph is force disabled on Ascend because DeepSeek V4 PIECEWISE cudagraph is not supported yet.
ERROR 08-14 02:59:07 [config.py:29] Failed to import Triton kernels. Please make sure your triton version is compatible. Error: No module named 'triton.language.target_info'
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xfffed9fc7740>, trust_remote_code=False, seed=0, num_prompts=200, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=256, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='vllm', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='Qwen/Qwen2.5-14B-Instruct', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=1.0, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/workspace/vllm-hust-benchmark/.benchmarks/backfill-single-gpu/runs/random-online-9ca08a102/bench', result_filename='raw.json', ignore_eos=False, self_timed=None, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-dccbbb22-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 08-14 02:59:09 [utils.py:90] Sampling input_len from [1024, 1024] and output_len from [256, 256]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 1.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 200/200 [03:33<00:00,  1.07s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     200       
Failed requests:                         0         
Request rate configured (RPS):           1.00      
Benchmark duration (s):                  213.78    
Total input tokens:                      204800    
Total generated tokens:                  51200     
Request throughput (req/s):              0.94      
Output token throughput (tok/s):         239.50    
Peak output token throughput (tok/s):    473.00    
Peak concurrent requests:                30.00     
Total token throughput (tok/s):          1197.52   
---------------Time to First Token----------------
Mean TTFT (ms):                          316.01    
Median TTFT (ms):                        273.30    
P99 TTFT (ms):                           737.15    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          64.52     
Median TPOT (ms):                        64.59     
P99 TPOT (ms):                           73.84     
---------------Inter-token Latency----------------
Mean ITL (ms):                           64.52     
Median ITL (ms):                         58.71     
P99 ITL (ms):                            162.03    
==================================================
sys:1: DeprecationWarning: builtin type swigvarlink has no __module__ attribute